[
  {
    "id": "INT-001",
    "title": "Education Support Intern",
    "company": "NextGen AI Labs",
    "location": "Pune, Maharashtra",
    "sector": "Social Sector",
    "skills": ["Community Outreach", "Communication", "Field Coordination"],
    "apply_url": "https://pm-internships.example/apply/INT-001",
    "job_description": "Join NextGen AI Labs to assist our education team in implementing digital literacy programs in rural schools. You'll coordinate with local teachers, organize workshops, and provide hands-on support to students. Strong communication and field coordination skills are essential.",
    "tags": ["field", "community", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-09-01",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Education Support Intern NextGen AI Labs Pune, Maharashtra Social Sector Community Outreach Communication Field Coordination field community part-time Join NextGen AI Labs to assist our education team in implementing digital literacy programs in rural schools. You'll coordinate with local teachers, organize workshops, and provide hands-on support to students. Strong communication and field coordination skills are essential."
  },
  {
    "id": "INT-002",
    "title": "Pharma Research Intern",
    "company": "SkyNet Solutions",
    "location": "Chennai, Tamil Nadu",
    "sector": "Healthcare",
    "skills": ["Biostatistics", "Lab Work", "Communication"],
    "apply_url": "https://pm-internships.example/apply/INT-002",
    "job_description": "We're looking for a Pharma Research Intern to support our R&D team. You will be responsible for conducting lab experiments, assisting with data collection, and performing biostatistical analysis. Excellent lab skills and attention to detail are required.",
    "tags": ["lab", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-09-02",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Pharma Research Intern SkyNet Solutions Chennai, Tamil Nadu Healthcare Biostatistics Lab Work Communication lab research full-time We're looking for a Pharma Research Intern to support our R&D team. You will be responsible for conducting lab experiments, assisting with data collection, and performing biostatistical analysis. Excellent lab skills and attention to detail are required."
  },
  {
    "id": "INT-003",
    "title": "Rural Outreach Intern",
    "company": "GeoIndia",
    "location": "Bengaluru, Karnataka",
    "sector": "Agriculture",
    "skills": ["IoT", "Field Research", "Logistics"],
    "apply_url": "https://pm-internships.example/apply/INT-003",
    "job_description": "Contribute to our rural expansion efforts at GeoIndia. This role involves extensive field research to identify agricultural needs, coordinating logistics for our IoT device deployment, and engaging with local farming communities.",
    "tags": ["field", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-09-03",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "Rural Outreach Intern GeoIndia Bengaluru, Karnataka Agriculture IoT Field Research Logistics field rural part-time Contribute to our rural expansion efforts at GeoIndia. This role involves extensive field research to identify agricultural needs, coordinating logistics for our IoT device deployment, and engaging with local farming communities."
  },
  {
    "id": "INT-004",
    "title": "Legal Research Intern",
    "company": "FarmTech India",
    "location": "Ahmedabad, Gujarat",
    "sector": "Legal",
    "skills": ["Drafting", "Cyber Law", "Legal Research"],
    "apply_url": "https://pm-internships.example/apply/INT-004",
    "job_description": "Assist our legal team with research and drafting. The intern will focus on legal precedents related to agricultural technology and cyber law compliance. This is an excellent opportunity to gain hands-on experience in a fast-paced legal environment.",
    "tags": ["legal", "research", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-09-04",
    "metadata": {"company_size":"10-50","industry":"agritech"},
    "text_blob": "Legal Research Intern FarmTech India Ahmedabad, Gujarat Legal Drafting Cyber Law Legal Research legal research remote-friendly Assist our legal team with research and drafting. The intern will focus on legal precedents related to agricultural technology and cyber law compliance. This is an excellent opportunity to gain hands-on experience in a fast-paced legal environment."
  },
  {
    "id": "INT-005",
    "title": "Creative Writing Intern",
    "company": "LawBridge Associates",
    "location": "Chennai, Tamil Nadu",
    "sector": "Media",
    "skills": ["Storytelling", "Writing", "SEO Basics"],
    "apply_url": "https://pm-internships.example/apply/INT-005",
    "job_description": "Do you have a knack for storytelling? As a Creative Writing Intern, you'll craft engaging content for our legal blogs and social media. Responsibilities include writing articles, developing narratives, and optimizing content for SEO to increase our online presence.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-09-05",
    "metadata": {"company_size":"50-200","industry":"legal"},
    "text_blob": "Creative Writing Intern LawBridge Associates Chennai, Tamil Nadu Media Storytelling Writing SEO Basics content writing remote-friendly Do you have a knack for storytelling? As a Creative Writing Intern, you'll craft engaging content for our legal blogs and social media. Responsibilities include writing articles, developing narratives, and optimizing content for SEO to increase our online presence."
  },
  {
    "id": "INT-006",
    "title": "Paralegal Intern",
    "company": "FarmTech India",
    "location": "Lucknow, Uttar Pradesh",
    "sector": "Legal",
    "skills": ["Legal Research", "Drafting", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-006",
    "job_description": "We are seeking a Paralegal Intern to support our legal department. Your duties will involve performing in-depth legal research, assisting with the drafting of legal documents, and ensuring compliance with cyber law regulations in the agricultural tech space.",
    "tags": ["legal", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-09-06",
    "metadata": {"company_size":"10-50","industry":"agritech"},
    "text_blob": "Paralegal Intern FarmTech India Lucknow, Uttar Pradesh Legal Legal Research Drafting Cyber Law legal research full-time We are seeking a Paralegal Intern to support our legal department. Your duties will involve performing in-depth legal research, assisting with the drafting of legal documents, and ensuring compliance with cyber law regulations in the agricultural tech space."
  },
  {
    "id": "INT-007",
    "title": "Risk Analysis Intern",
    "company": "AgriSupply Co.",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Finance",
    "skills": ["Accounting", "Financial Analysis", "Excel"],
    "apply_url": "https://pm-internships.example/apply/INT-007",
    "job_description": "Our finance team is hiring a Risk Analysis Intern. You will work on financial models, assist with accounting tasks, and use Excel to analyze market data. The ideal candidate will have a strong foundation in financial analysis and a keen eye for detail.",
    "tags": ["finance", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-18,000",
    "posted_at": "2025-09-07",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Risk Analysis Intern AgriSupply Co. Bhopal, Madhya Pradesh Finance Accounting Financial Analysis Excel finance data part-time Our finance team is hiring a Risk Analysis Intern. You will work on financial models, assist with accounting tasks, and use Excel to analyze market data. The ideal candidate will have a strong foundation in financial analysis and a keen eye for detail."
  },
  {
    "id": "INT-008",
    "title": "FinTech Intern",
    "company": "BioHealth Labs",
    "location": "Ahmedabad, Gujarat",
    "sector": "Finance",
    "skills": ["Risk Modeling", "Accounting", "Excel"],
    "apply_url": "https://pm-internships.example/apply/INT-008",
    "job_description": "We're seeking a driven FinTech Intern to join our finance department. You will be instrumental in developing risk models, managing accounting records, and utilizing advanced Excel functions to support our financial operations.",
    "tags": ["finance", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹10,000-20,000",
    "posted_at": "2025-09-08",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "FinTech Intern BioHealth Labs Ahmedabad, Gujarat Finance Risk Modeling Accounting Excel finance tech full-time We're seeking a driven FinTech Intern to join our finance department. You will be instrumental in developing risk models, managing accounting records, and utilizing advanced Excel functions to support our financial operations."
  },
  {
    "id": "INT-009",
    "title": "Fullstack Intern",
    "company": "NextGen AI Labs",
    "location": "Kolkata, West Bengal",
    "sector": "Information Technology",
    "skills": ["Kubernetes", "Machine Learning", "Cloud"],
    "apply_url": "https://pm-internships.example/apply/INT-009",
    "job_description": "An exciting opportunity for a Fullstack Intern to work on our AI-powered edtech platform. You'll work with technologies like Kubernetes and cloud services to develop and deploy features, while also getting exposure to machine learning projects.",
    "tags": ["tech", "software", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-09-09",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Fullstack Intern NextGen AI Labs Kolkata, West Bengal Information Technology Kubernetes Machine Learning Cloud tech software remote-friendly An exciting opportunity for a Fullstack Intern to work on our AI-powered edtech platform. You'll work with technologies like Kubernetes and cloud services to develop and deploy features, while also getting exposure to machine learning projects."
  },
  {
    "id": "INT-010",
    "title": "Rural Outreach Intern",
    "company": "Inkspire Studios",
    "location": "Nagpur, Maharashtra",
    "sector": "Agriculture",
    "skills": ["Logistics", "Field Research", "Crop Analytics"],
    "apply_url": "https://pm-internships.example/apply/INT-010",
    "job_description": "Join our team to support agricultural outreach. The intern will conduct field research to gather data on crop health, assist with logistical planning for supply chain efficiency, and use crop analytics to inform our project strategies.",
    "tags": ["field", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-09-10",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Rural Outreach Intern Inkspire Studios Nagpur, Maharashtra Agriculture Logistics Field Research Crop Analytics field rural part-time Join our team to support agricultural outreach. The intern will conduct field research to gather data on crop health, assist with logistical planning for supply chain efficiency, and use crop analytics to inform our project strategies."
  },
  {
    "id": "INT-011",
    "title": "Remote Sensing Intern",
    "company": "Sahitya Media",
    "location": "Remote",
    "sector": "Geospatial",
    "skills": ["GIS", "Remote Sensing", "Satellite Data"],
    "apply_url": "https://pm-internships.example/apply/INT-011",
    "job_description": "A remote internship for those passionate about geospatial technology. You'll use GIS tools to analyze satellite data, conduct remote sensing for environmental projects, and assist in creating detailed maps for publications.",
    "tags": ["geospatial", "data", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-09-11",
    "metadata": {"company_size":"50-200","industry":"media"},
    "text_blob": "Remote Sensing Intern Sahitya Media Remote Geospatial GIS Remote Sensing Satellite Data geospatial data remote A remote internship for those passionate about geospatial technology. You'll use GIS tools to analyze satellite data, conduct remote sensing for environmental projects, and assist in creating detailed maps for publications."
  },
  {
    "id": "INT-012",
    "title": "Cloud Engineering Intern",
    "company": "Inkspire Studios",
    "location": "Ahmedabad, Gujarat",
    "sector": "Information Technology",
    "skills": ["Java", "Kubernetes", "React"],
    "apply_url": "https://pm-internships.example/apply/INT-012",
    "job_description": "Seeking a Cloud Engineering Intern to help build and maintain our cloud infrastructure. The role involves developing applications in Java, orchestrating containers with Kubernetes, and assisting our front-end team with React components.",
    "tags": ["tech", "software", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-09-12",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Cloud Engineering Intern Inkspire Studios Ahmedabad, Gujarat Information Technology Java Kubernetes React tech software full-time Seeking a Cloud Engineering Intern to help build and maintain our cloud infrastructure. The role involves developing applications in Java, orchestrating containers with Kubernetes, and assisting our front-end team with React components."
  },
  {
    "id": "INT-013",
    "title": "Data Analysis Intern",
    "company": "Nayi Disha NGO",
    "location": "Bengaluru, Karnataka",
    "sector": "Healthcare",
    "skills": ["Communication", "Data Analysis", "Lab Work"],
    "apply_url": "https://pm-internships.example/apply/INT-013",
    "job_description": "Contribute to healthcare research by analyzing lab data to identify trends and insights. You'll work closely with our research scientists and communicate your findings to our team, helping us make data-driven decisions for our community health programs.",
    "tags": ["healthcare", "data", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-09-13",
    "metadata": {"company_size":"10-50","industry":"non-profit"},
    "text_blob": "Data Analysis Intern Nayi Disha NGO Bengaluru, Karnataka Healthcare Communication Data Analysis Lab Work healthcare data remote-friendly Contribute to healthcare research by analyzing lab data to identify trends and insights. You'll work closely with our research scientists and communicate your findings to our team, helping us make data-driven decisions for our community health programs."
  },
  {
    "id": "INT-014",
    "title": "Digital Marketing Intern",
    "company": "AgriSupply Co.",
    "location": "Bengaluru, Karnataka",
    "sector": "Marketing",
    "skills": ["Social Media", "Google Analytics", "SEO"],
    "apply_url": "https://pm-internships.example/apply/INT-014",
    "job_description": "Boost AgriSupply's digital presence. Your role will focus on creating compelling social media content, analyzing website traffic using Google Analytics, and implementing SEO best practices to improve our search engine rankings.",
    "tags": ["marketing", "digital", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-09-14",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Digital Marketing Intern AgriSupply Co. Bengaluru, Karnataka Marketing Social Media Google Analytics SEO marketing digital remote-friendly Boost AgriSupply's digital presence. Your role will focus on creating compelling social media content, analyzing website traffic using Google Analytics, and implementing SEO best practices to improve our search engine rankings."
  },
  {
    "id": "INT-015",
    "title": "Hospital Administration Intern",
    "company": "AdSphere Media",
    "location": "Bengaluru, Karnataka",
    "sector": "Healthcare",
    "skills": ["Biostatistics", "Lab Work", "Communication"],
    "apply_url": "https://pm-internships.example/apply/INT-015",
    "job_description": "We are seeking a Hospital Administration Intern to assist in the daily operations of our healthcare facility. This involves supporting lab work, helping with patient data management using biostatistics, and maintaining clear communication channels across departments.",
    "tags": ["healthcare", "admin", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-09-15",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Hospital Administration Intern AdSphere Media Bengaluru, Karnataka Healthcare Biostatistics Lab Work Communication healthcare admin full-time We are seeking a Hospital Administration Intern to assist in the daily operations of our healthcare facility. This involves supporting lab work, helping with patient data management using biostatistics, and maintaining clear communication channels across departments."
  },
  {
    "id": "INT-016",
    "title": "Legal Research Intern",
    "company": "AdSphere Media",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Legal",
    "skills": ["Cyber Law", "Drafting", "Legal Research"],
    "apply_url": "https://pm-internships.example/apply/INT-016",
    "job_description": "Support our legal team by conducting research on intellectual property and cyber law. You'll assist in drafting legal opinions and preparing case summaries, gaining invaluable experience in the media and technology legal landscape.",
    "tags": ["legal", "research", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-09-16",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Legal Research Intern AdSphere Media Bhopal, Madhya Pradesh Legal Cyber Law Drafting Legal Research legal research remote-friendly Support our legal team by conducting research on intellectual property and cyber law. You'll assist in drafting legal opinions and preparing case summaries, gaining invaluable experience in the media and technology legal landscape."
  },
  {
    "id": "INT-017",
    "title": "Community Outreach Intern",
    "company": "AdSphere Media",
    "location": "Mumbai, Maharashtra",
    "sector": "Social Sector",
    "skills": ["Communication", "Field Coordination", "MS Office"],
    "apply_url": "https://pm-internships.example/apply/INT-017",
    "job_description": "Help AdSphere Media connect with local communities for our corporate social responsibility initiatives. You'll assist in planning and coordinating events, managing communication with partner organizations, and maintaining records using MS Office suite.",
    "tags": ["field", "community", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-09-17",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Community Outreach Intern AdSphere Media Mumbai, Maharashtra Social Sector Communication Field Coordination MS Office field community part-time Help AdSphere Media connect with local communities for our corporate social responsibility initiatives. You'll assist in planning and coordinating events, managing communication with partner organizations, and maintaining records using MS Office suite."
  },
  {
    "id": "INT-018",
    "title": "Content Writing Intern",
    "company": "EarthVision",
    "location": "Remote",
    "sector": "Media",
    "skills": ["Writing", "SEO Basics", "Storytelling"],
    "apply_url": "https://pm-internships.example/apply/INT-018",
    "job_description": "EarthVision is looking for a remote Content Writing Intern to help us tell compelling stories about environmental conservation. You'll write blog posts, articles, and social media copy, applying basic SEO principles to help our content reach a wider audience.",
    "tags": ["content", "writing", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-09-18",
    "metadata": {"company_size":"50-200","industry":"geospatial"},
    "text_blob": "Content Writing Intern EarthVision Remote Media Writing SEO Basics Storytelling content writing remote EarthVision is looking for a remote Content Writing Intern to help us tell compelling stories about environmental conservation. You'll write blog posts, articles, and social media copy, applying basic SEO principles to help our content reach a wider audience."
  },
  {
    "id": "INT-019",
    "title": "AI Research Intern",
    "company": "NextGen AI Labs",
    "location": "Remote",
    "sector": "Information Technology",
    "skills": ["SQL", "Kubernetes", "Machine Learning"],
    "apply_url": "https://pm-internships.example/apply/INT-019",
    "job_description": "Advance your skills with a remote AI Research Internship. You will assist our senior researchers by running machine learning experiments, managing data pipelines with SQL, and deploying models using Kubernetes for our edtech solutions.",
    "tags": ["tech", "software", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-09-19",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "AI Research Intern NextGen AI Labs Remote Information Technology SQL Kubernetes Machine Learning tech software remote Advance your skills with a remote AI Research Internship. You will assist our senior researchers by running machine learning experiments, managing data pipelines with SQL, and deploying models using Kubernetes for our edtech solutions."
  },
  {
    "id": "INT-020",
    "title": "Pharma Research Intern",
    "company": "LifeCare Hospital",
    "location": "Ahmedabad, Gujarat",
    "sector": "Healthcare",
    "skills": ["MS Office", "Biostatistics", "Lab Work"],
    "apply_url": "https://pm-internships.example/apply/INT-020",
    "job_description": "Support our pharmaceutical research team by assisting with lab procedures and data management. You will use MS Office to organize data and perform basic biostatistical analysis to contribute to ongoing clinical studies.",
    "tags": ["lab", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-09-20",
    "metadata": {"company_size":"200-500","industry":"healthcare"},
    "text_blob": "Pharma Research Intern LifeCare Hospital Ahmedabad, Gujarat Healthcare MS Office Biostatistics Lab Work lab research full-time Support our pharmaceutical research team by assisting with lab procedures and data management. You will use MS Office to organize data and perform basic biostatistical analysis to contribute to ongoing clinical studies."
  },
  {
    "id": "INT-021",
    "title": "Remote Sensing Intern",
    "company": "NextGen AI Labs",
    "location": "Delhi, India",
    "sector": "Geospatial",
    "skills": ["Remote Sensing", "Satellite Data", "GIS"],
    "apply_url": "https://pm-internships.example/apply/INT-021",
    "job_description": "A part-time internship focused on leveraging geospatial technology for educational purposes. You will work with GIS software and analyze satellite data to develop interactive maps and visualizations for our learning platforms.",
    "tags": ["geospatial", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-09-21",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Remote Sensing Intern NextGen AI Labs Delhi, India Geospatial Remote Sensing Satellite Data GIS geospatial data part-time A part-time internship focused on leveraging geospatial technology for educational purposes. You will work with GIS software and analyze satellite data to develop interactive maps and visualizations for our learning platforms."
  },
  {
    "id": "INT-022",
    "title": "Policy Research Intern",
    "company": "Inkspire Studios",
    "location": "Pune, Maharashtra",
    "sector": "Social Sector",
    "skills": ["MS Office", "Community Outreach", "Field Coordination"],
    "apply_url": "https://pm-internships.example/apply/INT-022",
    "job_description": "As a Policy Research Intern, you'll conduct research on social sector policies that impact the creative arts industry. You'll assist with community outreach programs and coordinate field visits, using MS Office to document your findings.",
    "tags": ["research", "community", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-09-22",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Policy Research Intern Inkspire Studios Pune, Maharashtra Social Sector MS Office Community Outreach Field Coordination research community full-time As a Policy Research Intern, you'll conduct research on social sector policies that impact the creative arts industry. You'll assist with community outreach programs and coordinate field visits, using MS Office to document your findings."
  },
  {
    "id": "INT-023",
    "title": "Content Writing Intern",
    "company": "FarmTech India",
    "location": "Mumbai, Maharashtra",
    "sector": "Media",
    "skills": ["SEO Basics", "Writing", "Storytelling"],
    "apply_url": "https://pm-internships.example/apply/INT-023",
    "job_description": "We are seeking a Content Writing Intern to create engaging narratives about agricultural innovations. You will write articles, social media posts, and website content, focusing on storytelling and implementing SEO best practices.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-09-23",
    "metadata": {"company_size":"10-50","industry":"agritech"},
    "text_blob": "Content Writing Intern FarmTech India Mumbai, Maharashtra Media SEO Basics Writing Storytelling content writing remote-friendly We are seeking a Content Writing Intern to create engaging narratives about agricultural innovations. You will write articles, social media posts, and website content, focusing on storytelling and implementing SEO best practices."
  },
  {
    "id": "INT-024",
    "title": "Hospital Administration Intern",
    "company": "NextGen AI Labs",
    "location": "Chennai, Tamil Nadu",
    "sector": "Healthcare",
    "skills": ["Communication", "Biostatistics", "MS Office"],
    "apply_url": "https://pm-internships.example/apply/INT-024",
    "job_description": "Support the administrative team at our healthcare-focused AI lab. You will assist with patient communication, data entry, and using biostatistics to help analyze health outcomes. Strong organizational skills and proficiency in MS Office are a must.",
    "tags": ["healthcare", "admin", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-09-24",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Hospital Administration Intern NextGen AI Labs Chennai, Tamil Nadu Healthcare Communication Biostatistics MS Office healthcare admin full-time Support the administrative team at our healthcare-focused AI lab. You will assist with patient communication, data entry, and using biostatistics to help analyze health outcomes. Strong organizational skills and proficiency in MS Office are a must."
  },
  {
    "id": "INT-025",
    "title": "Pharma Research Intern",
    "company": "NextGen AI Labs",
    "location": "Mumbai, Maharashtra",
    "sector": "Healthcare",
    "skills": ["Data Analysis", "MS Office", "Biostatistics"],
    "apply_url": "https://pm-internships.example/apply/INT-025",
    "job_description": "Work with our healthcare research division to analyze clinical data. This role involves using statistical software to perform biostatistical analysis, organizing large datasets with MS Office tools, and contributing to research papers.",
    "tags": ["lab", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-09-25",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Pharma Research Intern NextGen AI Labs Mumbai, Maharashtra Healthcare Data Analysis MS Office Biostatistics lab research full-time Work with our healthcare research division to analyze clinical data. This role involves using statistical software to perform biostatistical analysis, organizing large datasets with MS Office tools, and contributing to research papers."
  },
  {
    "id": "INT-026",
    "title": "Geospatial Data Intern",
    "company": "Swasth Analytics",
    "location": "Patna, Bihar",
    "sector": "Geospatial",
    "skills": ["Satellite Data", "QGIS", "GIS"],
    "apply_url": "https://pm-internships.example/apply/INT-026",
    "job_description": "Help us map health-related data points across different regions. You'll process and analyze satellite data, create detailed maps using QGIS and other GIS software, and contribute to our geospatial database.",
    "tags": ["geospatial", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-09-26",
    "metadata": {"company_size":"50-200","industry":"healthcare"},
    "text_blob": "Geospatial Data Intern Swasth Analytics Patna, Bihar Geospatial Satellite Data QGIS GIS geospatial data part-time Help us map health-related data points across different regions. You'll process and analyze satellite data, create detailed maps using QGIS and other GIS software, and contribute to our geospatial database."
  },
  {
    "id": "INT-027",
    "title": "Fullstack Intern",
    "company": "BioHealth Labs",
    "location": "Remote",
    "sector": "Information Technology",
    "skills": ["Cloud", "Kubernetes", "SQL"],
    "apply_url": "https://pm-internships.example/apply/INT-027",
    "job_description": "A remote role for a Fullstack Intern with a focus on cloud-native applications. You will work on both front-end and back-end development, manage databases with SQL, and use Kubernetes to deploy and scale our services.",
    "tags": ["tech", "software", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-09-27",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Fullstack Intern BioHealth Labs Remote Information Technology Cloud Kubernetes SQL tech software remote A remote role for a Fullstack Intern with a focus on cloud-native applications. You will work on both front-end and back-end development, manage databases with SQL, and use Kubernetes to deploy and scale our services."
  },
  {
    "id": "INT-028",
    "title": "AgriTech Intern",
    "company": "Digital Bharat Labs",
    "location": "Chennai, Tamil Nadu",
    "sector": "Agriculture",
    "skills": ["Field Research", "Crop Analytics", "IoT"],
    "apply_url": "https://pm-internships.example/apply/INT-028",
    "job_description": "As an AgriTech Intern, you'll be on the front lines of agricultural innovation. Your responsibilities include field research to collect data, implementing IoT solutions for crop monitoring, and using analytics to provide actionable insights to farmers.",
    "tags": ["tech", "agri", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹10,000-20,000",
    "posted_at": "2025-09-28",
    "metadata": {"company_size":"50-200","industry":"edtech"},
    "text_blob": "AgriTech Intern Digital Bharat Labs Chennai, Tamil Nadu Agriculture Field Research Crop Analytics IoT tech agri full-time As an AgriTech Intern, you'll be on the front lines of agricultural innovation. Your responsibilities include field research to collect data, implementing IoT solutions for crop monitoring, and using analytics to provide actionable insights to farmers."
  },
  {
    "id": "INT-029",
    "title": "Cyber Law Intern",
    "company": "AgriSupply Co.",
    "location": "Remote",
    "sector": "Legal",
    "skills": ["Legal Research", "Drafting", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-029",
    "job_description": "We are hiring a remote Cyber Law Intern to support our legal compliance team. You will conduct legal research on digital contracts and data privacy, assist with drafting legal documents, and ensure our online practices adhere to current cyber law regulations.",
    "tags": ["legal", "tech", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-09-29",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Cyber Law Intern AgriSupply Co. Remote Legal Legal Research Drafting Cyber Law legal tech remote We are hiring a remote Cyber Law Intern to support our legal compliance team. You will conduct legal research on digital contracts and data privacy, assist with drafting legal documents, and ensure our online practices adhere to current cyber law regulations."
  },
  {
    "id": "INT-030",
    "title": "Creative Writing Intern",
    "company": "NextGen AI Labs",
    "location": "Delhi, India",
    "sector": "Media",
    "skills": ["Research", "Writing", "Storytelling"],
    "apply_url": "https://pm-internships.example/apply/INT-030",
    "job_description": "Our marketing team is looking for a Creative Writing Intern to help shape our brand voice. You'll research industry trends, write compelling stories about the impact of our technology, and craft content for blogs and marketing campaigns.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-09-30",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Creative Writing Intern NextGen AI Labs Delhi, India Media Research Writing Storytelling content writing remote-friendly Our marketing team is looking for a Creative Writing Intern to help shape our brand voice. You'll research industry trends, write compelling stories about the impact of our technology, and craft content for blogs and marketing campaigns."
  },
  {
    "id": "INT-031",
    "title": "Market Research Intern",
    "company": "BioHealth Labs",
    "location": "Hyderabad, Telangana",
    "sector": "Marketing",
    "skills": ["Content Creation", "SEO", "Communication"],
    "apply_url": "https://pm-internships.example/apply/INT-031",
    "job_description": "Assist our marketing team in identifying market trends for our biotech products. You'll create content to engage target audiences, apply SEO strategies to improve visibility, and communicate market insights to stakeholders.",
    "tags": ["marketing", "research", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-10-01",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Market Research Intern BioHealth Labs Hyderabad, Telangana Marketing Content Creation SEO Communication marketing research part-time Assist our marketing team in identifying market trends for our biotech products. You'll create content to engage target audiences, apply SEO strategies to improve visibility, and communicate market insights to stakeholders."
  },
  {
    "id": "INT-032",
    "title": "Education Support Intern",
    "company": "LawBridge Associates",
    "location": "Nagpur, Maharashtra",
    "sector": "Social Sector",
    "skills": ["Field Coordination", "MS Office", "Communication"],
    "apply_url": "https://pm-internships.example/apply/INT-032",
    "job_description": "LawBridge Associates is seeking an Education Support Intern for our pro bono legal aid and awareness programs. You will coordinate educational sessions in the field, communicate with community members, and use MS Office to manage program data and reports.",
    "tags": ["field", "community", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-10-02",
    "metadata": {"company_size":"50-200","industry":"legal"},
    "text_blob": "Education Support Intern LawBridge Associates Nagpur, Maharashtra Social Sector Field Coordination MS Office Communication field community part-time LawBridge Associates is seeking an Education Support Intern for our pro bono legal aid and awareness programs. You will coordinate educational sessions in the field, communicate with community members, and use MS Office to manage program data and reports."
  },
  {
    "id": "INT-033",
    "title": "Digital Marketing Intern",
    "company": "AgriSupply Co.",
    "location": "Patna, Bihar",
    "sector": "Marketing",
    "skills": ["Social Media", "Google Analytics", "SEO"],
    "apply_url": "https://pm-internships.example/apply/INT-033",
    "job_description": "Help us expand our brand's reach in rural markets. You'll manage social media campaigns, use Google Analytics to track performance, and work on SEO optimization to improve our online visibility for agricultural products.",
    "tags": ["marketing", "digital", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-10-03",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Digital Marketing Intern AgriSupply Co. Patna, Bihar Marketing Social Media Google Analytics SEO marketing digital remote-friendly Help us expand our brand's reach in rural markets. You'll manage social media campaigns, use Google Analytics to track performance, and work on SEO optimization to improve our online visibility for agricultural products."
  },
  {
    "id": "INT-034",
    "title": "Market Research Intern",
    "company": "NextGen AI Labs",
    "location": "Kolkata, West Bengal",
    "sector": "Marketing",
    "skills": ["Google Analytics", "Social Media", "SEO"],
    "apply_url": "https://pm-internships.example/apply/INT-034",
    "job_description": "As a Market Research Intern, you'll analyze market trends for our AI education products. You'll use Google Analytics to monitor user behavior, manage social media data, and help refine our SEO strategy based on your findings.",
    "tags": ["marketing", "research", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-10-04",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Market Research Intern NextGen AI Labs Kolkata, West Bengal Marketing Google Analytics Social Media SEO marketing research part-time As a Market Research Intern, you'll analyze market trends for our AI education products. You'll use Google Analytics to monitor user behavior, manage social media data, and help refine our SEO strategy based on your findings."
  },
  {
    "id": "INT-035",
    "title": "Policy Research Intern",
    "company": "GeoIndia",
    "location": "Bengaluru, Karnataka",
    "sector": "Social Sector",
    "skills": ["Field Coordination", "Community Outreach", "Communication"],
    "apply_url": "https://pm-internships.example/apply/INT-035",
    "job_description": "We are seeking a Policy Research Intern to investigate and report on government policies affecting rural development. You will coordinate with our field teams, conduct community outreach, and communicate your findings to inform our strategic decisions.",
    "tags": ["research", "community", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-10-05",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "Policy Research Intern GeoIndia Bengaluru, Karnataka Social Sector Field Coordination Community Outreach Communication research community full-time We are seeking a Policy Research Intern to investigate and report on government policies affecting rural development. You will coordinate with our field teams, conduct community outreach, and communicate your findings to inform our strategic decisions."
  },
  {
    "id": "INT-036",
    "title": "Pharma Research Intern",
    "company": "AdSphere Media",
    "location": "Lucknow, Uttar Pradesh",
    "sector": "Healthcare",
    "skills": ["Lab Work", "Biostatistics", "Data Analysis"],
    "apply_url": "https://pm-internships.example/apply/INT-036",
    "job_description": "Join our healthcare-focused research team. You'll assist with hands-on lab work, perform data analysis on clinical trial results, and use biostatistics to identify significant trends in our research findings.",
    "tags": ["lab", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-10-06",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Pharma Research Intern AdSphere Media Lucknow, Uttar Pradesh Healthcare Lab Work Biostatistics Data Analysis lab research full-time Join our healthcare-focused research team. You'll assist with hands-on lab work, perform data analysis on clinical trial results, and use biostatistics to identify significant trends in our research findings."
  },
  {
    "id": "INT-037",
    "title": "Journalism Intern",
    "company": "Sahitya Media",
    "location": "Nagpur, Maharashtra",
    "sector": "Media",
    "skills": ["Storytelling", "Writing", "SEO Basics"],
    "apply_url": "https://pm-internships.example/apply/INT-037",
    "job_description": "Sahitya Media is seeking a Journalism Intern to report on local news and events. You will be responsible for interviewing sources, writing compelling news stories, and applying basic SEO principles to ensure your articles are easily discoverable online.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-10-07",
    "metadata": {"company_size":"50-200","industry":"media"},
    "text_blob": "Journalism Intern Sahitya Media Nagpur, Maharashtra Media Storytelling Writing SEO Basics content writing remote-friendly Sahitya Media is seeking a Journalism Intern to report on local news and events. You will be responsible for interviewing sources, writing compelling news stories, and applying basic SEO principles to ensure your articles are easily discoverable online."
  },
  {
    "id": "INT-038",
    "title": "AgriTech Intern",
    "company": "GeoIndia",
    "location": "Chennai, Tamil Nadu",
    "sector": "Agriculture",
    "skills": ["IoT", "Logistics", "Field Research"],
    "apply_url": "https://pm-internships.example/apply/INT-038",
    "job_description": "Work at the intersection of agriculture and technology. As an AgriTech Intern, you will conduct field research to identify farmer needs, assist with the logistics of deploying IoT sensors, and help streamline our supply chain.",
    "tags": ["tech", "agri", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹10,000-20,000",
    "posted_at": "2025-10-08",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "AgriTech Intern GeoIndia Chennai, Tamil Nadu Agriculture IoT Logistics Field Research tech agri full-time Work at the intersection of agriculture and technology. As an AgriTech Intern, you will conduct field research to identify farmer needs, assist with the logistics of deploying IoT sensors, and help streamline our supply chain."
  },
  {
    "id": "INT-039",
    "title": "Risk Analysis Intern",
    "company": "BioHealth Labs",
    "location": "Remote",
    "sector": "Finance",
    "skills": ["Excel", "Financial Analysis", "Risk Modeling"],
    "apply_url": "https://pm-internships.example/apply/INT-039",
    "job_description": "We are seeking a remote intern to support our finance and operations teams. You will use Excel for financial analysis, help build and refine risk models for new projects, and analyze market trends to inform business decisions.",
    "tags": ["finance", "data", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹8,000-18,000",
    "posted_at": "2025-10-09",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Risk Analysis Intern BioHealth Labs Remote Finance Excel Financial Analysis Risk Modeling finance data remote We are seeking a remote intern to support our finance and operations teams. You will use Excel for financial analysis, help build and refine risk models for new projects, and analyze market trends to inform business decisions."
  },
  {
    "id": "INT-040",
    "title": "Policy Research Intern",
    "company": "LawBridge Associates",
    "location": "Chennai, Tamil Nadu",
    "sector": "Social Sector",
    "skills": ["Community Outreach", "Field Coordination", "MS Office"],
    "apply_url": "https://pm-internships.example/apply/INT-040",
    "job_description": "Contribute to our pro bono legal policy research. This role involves researching how policies affect marginalized communities, coordinating field visits, and communicating with community leaders. You'll also use MS Office to prepare detailed reports and presentations.",
    "tags": ["research", "community", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-10-10",
    "metadata": {"company_size":"50-200","industry":"legal"},
    "text_blob": "Policy Research Intern LawBridge Associates Chennai, Tamil Nadu Social Sector Community Outreach Field Coordination MS Office research community full-time Contribute to our pro bono legal policy research. This role involves researching how policies affect marginalized communities, coordinating field visits, and communicating with community leaders. You'll also use MS Office to prepare detailed reports and presentations."
  },
  {
    "id": "INT-041",
    "title": "GIS Mapping Intern",
    "company": "NextGen AI Labs",
    "location": "Lucknow, Uttar Pradesh",
    "sector": "Geospatial",
    "skills": ["Satellite Data", "Remote Sensing", "GIS"],
    "apply_url": "https://pm-internships.example/apply/INT-041",
    "job_description": "Join our GIS team to help create educational mapping tools. You will analyze satellite data, perform remote sensing tasks, and use GIS software to build interactive maps for our online learning platforms.",
    "tags": ["geospatial", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-10-11",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "GIS Mapping Intern NextGen AI Labs Lucknow, Uttar Pradesh Geospatial Satellite Data Remote Sensing GIS geospatial data part-time Join our GIS team to help create educational mapping tools. You will analyze satellite data, perform remote sensing tasks, and use GIS software to build interactive maps for our online learning platforms."
  },
  {
    "id": "INT-042",
    "title": "AI Research Intern",
    "company": "SkyNet Solutions",
    "location": "Delhi, India",
    "sector": "Information Technology",
    "skills": ["React", "Python", "Cloud"],
    "apply_url": "https://pm-internships.example/apply/INT-042",
    "job_description": "We are seeking an AI Research Intern to assist in the development of our AI-powered biotech solutions. You'll primarily work with Python, develop front-end interfaces with React, and manage our cloud infrastructure.",
    "tags": ["tech", "software", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-10-12",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "AI Research Intern SkyNet Solutions Delhi, India Information Technology React Python Cloud tech software remote-friendly We are seeking an AI Research Intern to assist in the development of our AI-powered biotech solutions. You'll primarily work with Python, develop front-end interfaces with React, and manage our cloud infrastructure."
  },
  {
    "id": "INT-043",
    "title": "Accounting Intern",
    "company": "MobileFirst India",
    "location": "Bengaluru, Karnataka",
    "sector": "Finance",
    "skills": ["Financial Analysis", "Risk Modeling", "Accounting"],
    "apply_url": "https://pm-internships.example/apply/INT-043",
    "job_description": "Our finance department is looking for an Accounting Intern. You'll assist with daily accounting tasks, perform financial analysis on our business operations, and contribute to risk modeling for new ventures in the mobile tech industry.",
    "tags": ["finance", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-18,000",
    "posted_at": "2025-10-13",
    "metadata": {"company_size":"100-500","industry":"fintech"},
    "text_blob": "Accounting Intern MobileFirst India Bengaluru, Karnataka Finance Financial Analysis Risk Modeling Accounting finance data part-time Our finance department is looking for an Accounting Intern. You'll assist with daily accounting tasks, perform financial analysis on our business operations, and contribute to risk modeling for new ventures in the mobile tech industry."
  },
  {
    "id": "INT-044",
    "title": "Cyber Law Intern",
    "company": "AdSphere Media",
    "location": "Hyderabad, Telangana",
    "sector": "Legal",
    "skills": ["Cyber Law", "Legal Research", "Drafting"],
    "apply_url": "https://pm-internships.example/apply/INT-044",
    "job_description": "Join our legal team and focus on cyber law. You will be conducting legal research on data security regulations, drafting internal policies, and advising on legal risks related to our digital media content.",
    "tags": ["legal", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-10-14",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Cyber Law Intern AdSphere Media Hyderabad, Telangana Legal Cyber Law Legal Research Drafting legal tech full-time Join our legal team and focus on cyber law. You will be conducting legal research on data security regulations, drafting internal policies, and advising on legal risks related to our digital media content."
  },
  {
    "id": "INT-045",
    "title": "Remote Sensing Intern",
    "company": "Inkspire Studios",
    "location": "Ahmedabad, Gujarat",
    "sector": "Geospatial",
    "skills": ["QGIS", "GIS", "Satellite Data"],
    "apply_url": "https://pm-internships.example/apply/INT-045",
    "job_description": "We are seeking a Remote Sensing Intern to assist our environmental visualization projects. The role involves processing satellite data, creating and analyzing maps with QGIS and other GIS tools, and contributing to our visual media content.",
    "tags": ["geospatial", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-10-15",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Remote Sensing Intern Inkspire Studios Ahmedabad, Gujarat Geospatial QGIS GIS Satellite Data geospatial data part-time We are seeking a Remote Sensing Intern to assist our environmental visualization projects. The role involves processing satellite data, creating and analyzing maps with QGIS and other GIS tools, and contributing to our visual media content."
  },
  {
    "id": "INT-046",
    "title": "Remote Sensing Intern",
    "company": "Sahitya Media",
    "location": "Hyderabad, Telangana",
    "sector": "Geospatial",
    "skills": ["Remote Sensing", "Satellite Data", "GIS"],
    "apply_url": "https://pm-internships.example/apply/INT-046",
    "job_description": "Contribute to our data journalism efforts by analyzing satellite imagery. You'll use remote sensing techniques to gather data, apply GIS software to create visual stories, and process satellite data to support our reporting.",
    "tags": ["geospatial", "data", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-10-16",
    "metadata": {"company_size":"50-200","industry":"media"},
    "text_blob": "Remote Sensing Intern Sahitya Media Hyderabad, Telangana Geospatial Remote Sensing Satellite Data GIS geospatial data remote-friendly Contribute to our data journalism efforts by analyzing satellite imagery. You'll use remote sensing techniques to gather data, apply GIS software to create visual stories, and process satellite data to support our reporting."
  },
  {
    "id": "INT-047",
    "title": "Geospatial Data Intern",
    "company": "LawBridge Associates",
    "location": "Remote",
    "sector": "Geospatial",
    "skills": ["QGIS", "GIS", "Satellite Data"],
    "apply_url": "https://pm-internships.example/apply/INT-047",
    "job_description": "A remote role focused on geospatial data analysis for legal cases. You will process satellite data to map land boundaries and property disputes, and use GIS and QGIS to create visualizations that support legal arguments.",
    "tags": ["geospatial", "data", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-10-17",
    "metadata": {"company_size":"50-200","industry":"legal"},
    "text_blob": "Geospatial Data Intern LawBridge Associates Remote Geospatial QGIS GIS Satellite Data geospatial data remote A remote role focused on geospatial data analysis for legal cases. You will process satellite data to map land boundaries and property disputes, and use GIS and QGIS to create visualizations that support legal arguments."
  },
  {
    "id": "INT-048",
    "title": "Rural Marketing Intern",
    "company": "EarthVision",
    "location": "Kolkata, West Bengal",
    "sector": "Marketing",
    "skills": ["Content Creation", "Communication", "Social Media"],
    "apply_url": "https://pm-internships.example/apply/INT-048",
    "job_description": "Help us reach rural communities with our environmental initiatives. You'll create compelling content for local social media campaigns, communicate with community leaders, and develop marketing strategies tailored for rural audiences.",
    "tags": ["marketing", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-10-18",
    "metadata": {"company_size":"50-200","industry":"geospatial"},
    "text_blob": "Rural Marketing Intern EarthVision Kolkata, West Bengal Marketing Content Creation Communication Social Media marketing rural part-time Help us reach rural communities with our environmental initiatives. You'll create compelling content for local social media campaigns, communicate with community leaders, and develop marketing strategies tailored for rural audiences."
  },
  {
    "id": "INT-049",
    "title": "Community Outreach Intern",
    "company": "SkyNet Solutions",
    "location": "Ahmedabad, Gujarat",
    "sector": "Social Sector",
    "skills": ["MS Office", "Communication", "Community Outreach"],
    "apply_url": "https://pm-internships.example/apply/INT-049",
    "job_description": "Join our CSR team to organize health and wellness camps. You'll be responsible for community outreach, communicating with local leaders, and managing participant data using MS Office. Your role will directly impact public health initiatives.",
    "tags": ["field", "community", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-10-19",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Community Outreach Intern SkyNet Solutions Ahmedabad, Gujarat Social Sector MS Office Communication Community Outreach field community part-time Join our CSR team to organize health and wellness camps. You'll be responsible for community outreach, communicating with local leaders, and managing participant data using MS Office. Your role will directly impact public health initiatives."
  },
  {
    "id": "INT-050",
    "title": "Content Writing Intern",
    "company": "EarthVision",
    "location": "Pune, Maharashtra",
    "sector": "Media",
    "skills": ["Research", "Storytelling", "SEO Basics"],
    "apply_url": "https://pm-internships.example/apply/INT-050",
    "job_description": "EarthVision is seeking a Content Writing Intern to help us create content about sustainability and conservation. You will conduct research on environmental topics, craft compelling stories, and apply SEO fundamentals to improve our content reach.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-10-20",
    "metadata": {"company_size":"50-200","industry":"geospatial"},
    "text_blob": "Content Writing Intern EarthVision Pune, Maharashtra Media Research Storytelling SEO Basics content writing remote-friendly EarthVision is seeking a Content Writing Intern to help us create content about sustainability and conservation. You will conduct research on environmental topics, craft compelling stories, and apply SEO fundamentals to improve our content reach."
  },
  {
    "id": "INT-051",
    "title": "Community Outreach Intern",
    "company": "BioHealth Labs",
    "location": "Delhi, India",
    "sector": "Social Sector",
    "skills": ["MS Office", "Field Coordination", "Community Outreach"],
    "apply_url": "https://pm-internships.example/apply/INT-051",
    "job_description": "We are seeking a Community Outreach Intern to assist with our health awareness campaigns. The role involves coordinating field activities, conducting community outreach, and using MS Office to track engagement and report on progress.",
    "tags": ["field", "community", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-10-21",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Community Outreach Intern BioHealth Labs Delhi, India Social Sector MS Office Field Coordination Community Outreach field community part-time We are seeking a Community Outreach Intern to assist with our health awareness campaigns. The role involves coordinating field activities, conducting community outreach, and using MS Office to track engagement and report on progress."
  },
  {
    "id": "INT-052",
    "title": "Content Writing Intern",
    "company": "Inkspire Studios",
    "location": "Delhi, India",
    "sector": "Media",
    "skills": ["SEO Basics", "Storytelling", "Research"],
    "apply_url": "https://pm-internships.example/apply/INT-052",
    "job_description": "Join our creative team to write engaging content for our digital platforms. You'll conduct research on a variety of topics, craft compelling stories, and apply SEO basics to ensure our content ranks well on search engines.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-10-22",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Content Writing Intern Inkspire Studios Delhi, India Media SEO Basics Storytelling Research content writing remote-friendly Join our creative team to write engaging content for our digital platforms. You'll conduct research on a variety of topics, craft compelling stories, and apply SEO basics to ensure our content ranks well on search engines."
  },
  {
    "id": "INT-053",
    "title": "Cyber Law Intern",
    "company": "AgriSupply Co.",
    "location": "Patna, Bihar",
    "sector": "Legal",
    "skills": ["Drafting", "Legal Research", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-053",
    "job_description": "We're hiring a Cyber Law Intern to support our legal team. Your work will involve researching and drafting legal documents related to data privacy, intellectual property, and cybersecurity within the agricultural supply chain.",
    "tags": ["legal", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-10-23",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Cyber Law Intern AgriSupply Co. Patna, Bihar Legal Drafting Legal Research Cyber Law legal tech full-time We're hiring a Cyber Law Intern to support our legal team. Your work will involve researching and drafting legal documents related to data privacy, intellectual property, and cybersecurity within the agricultural supply chain."
  },
  {
    "id": "INT-054",
    "title": "Rural Marketing Intern",
    "company": "EarthVision",
    "location": "Bengaluru, Karnataka",
    "sector": "Marketing",
    "skills": ["SEO", "Content Creation", "Google Analytics"],
    "apply_url": "https://pm-internships.example/apply/INT-054",
    "job_description": "As a Rural Marketing Intern, you'll help us develop and execute marketing strategies for rural audiences. You will create engaging content, use Google Analytics to measure campaign performance, and apply SEO to improve online visibility.",
    "tags": ["marketing", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-10-24",
    "metadata": {"company_size":"50-200","industry":"geospatial"},
    "text_blob": "Rural Marketing Intern EarthVision Bengaluru, Karnataka Marketing SEO Content Creation Google Analytics marketing rural part-time As a Rural Marketing Intern, you'll help us develop and execute marketing strategies for rural audiences. You will create engaging content, use Google Analytics to measure campaign performance, and apply SEO to improve online visibility."
  },
  {
    "id": "INT-055",
    "title": "Journalism Intern",
    "company": "LifeCare Hospital",
    "location": "Nagpur, Maharashtra",
    "sector": "Media",
    "skills": ["Storytelling", "SEO Basics", "Research"],
    "apply_url": "https://pm-internships.example/apply/INT-055",
    "job_description": "LifeCare Hospital is seeking a Journalism Intern to help us share patient stories and healthcare news. You will research health topics, write compelling articles, and use storytelling to connect with our audience, all while implementing SEO basics.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-10-25",
    "metadata": {"company_size":"200-500","industry":"healthcare"},
    "text_blob": "Journalism Intern LifeCare Hospital Nagpur, Maharashtra Media Storytelling SEO Basics Research content writing remote-friendly LifeCare Hospital is seeking a Journalism Intern to help us share patient stories and healthcare news. You will research health topics, write compelling articles, and use storytelling to connect with our audience, all while implementing SEO basics."
  },
  {
    "id": "INT-056",
    "title": "Geospatial Data Intern",
    "company": "Inkspire Studios",
    "location": "Kolkata, West Bengal",
    "sector": "Geospatial",
    "skills": ["QGIS", "GIS", "Remote Sensing"],
    "apply_url": "https://pm-internships.example/apply/INT-056",
    "job_description": "Assist our team in using geospatial data for visual media projects. You'll process and analyze data using GIS and QGIS, perform remote sensing tasks, and contribute to the creation of interactive maps and visualizations for our documentaries.",
    "tags": ["geospatial", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-10-26",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Geospatial Data Intern Inkspire Studios Kolkata, West Bengal Geospatial QGIS GIS Remote Sensing geospatial data part-time Assist our team in using geospatial data for visual media projects. You'll process and analyze data using GIS and QGIS, perform remote sensing tasks, and contribute to the creation of interactive maps and visualizations for our documentaries."
  },
  {
    "id": "INT-057",
    "title": "GIS Mapping Intern",
    "company": "Sahitya Media",
    "location": "Remote",
    "sector": "Geospatial",
    "skills": ["Satellite Data", "GIS", "Remote Sensing"],
    "apply_url": "https://pm-internships.example/apply/INT-057",
    "job_description": "We are seeking a GIS Mapping Intern to work on remote projects for our data journalism division. You will analyze satellite data, use GIS software to create detailed maps, and apply remote sensing techniques to support our investigative reports.",
    "tags": ["geospatial", "data", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-10-27",
    "metadata": {"company_size":"50-200","industry":"media"},
    "text_blob": "GIS Mapping Intern Sahitya Media Remote Geospatial Satellite Data GIS Remote Sensing geospatial data remote We are seeking a GIS Mapping Intern to work on remote projects for our data journalism division. You will analyze satellite data, use GIS software to create detailed maps, and apply remote sensing techniques to support our investigative reports."
  },
  {
    "id": "INT-058",
    "title": "Market Research Intern",
    "company": "FinSecure Pvt Ltd",
    "location": "Delhi, India",
    "sector": "Marketing",
    "skills": ["Content Creation", "Social Media", "Google Analytics"],
    "apply_url": "https://pm-internships.example/apply/INT-058",
    "job_description": "Contribute to market research for our financial security products. You will create engaging content for social media, analyze campaign performance using Google Analytics, and help us understand our target market.",
    "tags": ["marketing", "research", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-10-28",
    "metadata": {"company_size":"10-50","industry":"fintech"},
    "text_blob": "Market Research Intern FinSecure Pvt Ltd Delhi, India Marketing Content Creation Social Media Google Analytics marketing research part-time Contribute to market research for our financial security products. You will create engaging content for social media, analyze campaign performance using Google Analytics, and help us understand our target market."
  },
  {
    "id": "INT-059",
    "title": "Digital Marketing Intern",
    "company": "Nayi Disha NGO",
    "location": "Delhi, India",
    "sector": "Marketing",
    "skills": ["Social Media", "Communication", "Content Creation"],
    "apply_url": "https://pm-internships.example/apply/INT-059",
    "job_description": "Nayi Disha NGO is looking for a Digital Marketing Intern to help us promote our social initiatives. You will create content for social media, manage online communications, and develop marketing materials to raise awareness and support for our projects.",
    "tags": ["marketing", "digital", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-10-29",
    "metadata": {"company_size":"10-50","industry":"non-profit"},
    "text_blob": "Digital Marketing Intern Nayi Disha NGO Delhi, India Marketing Social Media Communication Content Creation marketing digital remote-friendly Nayi Disha NGO is looking for a Digital Marketing Intern to help us promote our social initiatives. You will create content for social media, manage online communications, and develop marketing materials to raise awareness and support for our projects."
  },
  {
    "id": "INT-060",
    "title": "Data Analysis Intern",
    "company": "MobileFirst India",
    "location": "Chennai, Tamil Nadu",
    "sector": "Healthcare",
    "skills": ["Lab Work", "Biostatistics", "Data Analysis"],
    "apply_url": "https://pm-internships.example/apply/INT-060",
    "job_description": "We are seeking a Data Analysis Intern to work with our healthcare technology team. You'll assist with lab data collection, perform biostatistical analysis, and help us identify trends in patient data to improve our mobile health applications.",
    "tags": ["healthcare", "data", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-10-30",
    "metadata": {"company_size":"100-500","industry":"fintech"},
    "text_blob": "Data Analysis Intern MobileFirst India Chennai, Tamil Nadu Healthcare Lab Work Biostatistics Data Analysis healthcare data remote-friendly We are seeking a Data Analysis Intern to work with our healthcare technology team. You'll assist with lab data collection, perform biostatistical analysis, and help us identify trends in patient data to improve our mobile health applications."
  },
  {
    "id": "INT-061",
    "title": "Cyber Law Intern",
    "company": "CityCare Hospital",
    "location": "Kolkata, West Bengal",
    "sector": "Legal",
    "skills": ["Legal Research", "Drafting", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-061",
    "job_description": "Join the legal team at CityCare Hospital to focus on data privacy and cybersecurity. You will conduct legal research on patient data regulations, assist in drafting compliance documents, and advise on cyber law issues.",
    "tags": ["legal", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-10-31",
    "metadata": {"company_size":"50-200","industry":"healthcare"},
    "text_blob": "Cyber Law Intern CityCare Hospital Kolkata, West Bengal Legal Legal Research Drafting Cyber Law legal tech full-time Join the legal team at CityCare Hospital to focus on data privacy and cybersecurity. You will conduct legal research on patient data regulations, assist in drafting compliance documents, and advise on cyber law issues."
  },
  {
    "id": "INT-062",
    "title": "Web Development Intern",
    "company": "AgriSupply Co.",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Information Technology",
    "skills": ["Docker", "SQL", "Python"],
    "apply_url": "https://pm-internships.example/apply/INT-062",
    "job_description": "We are looking for a Web Development Intern to help build and maintain our e-commerce platform. You will work on back-end development using Python, manage databases with SQL, and use Docker for containerization.",
    "tags": ["tech", "software", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-11-01",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Web Development Intern AgriSupply Co. Bhopal, Madhya Pradesh Information Technology Docker SQL Python tech software remote-friendly We are looking for a Web Development Intern to help build and maintain our e-commerce platform. You will work on back-end development using Python, manage databases with SQL, and use Docker for containerization."
  },
  {
    "id": "INT-063",
    "title": "Community Outreach Intern",
    "company": "SkyNet Solutions",
    "location": "Remote",
    "sector": "Social Sector",
    "skills": ["Communication", "MS Office", "Community Outreach"],
    "apply_url": "https://pm-internships.example/apply/INT-063",
    "job_description": "A remote role for a Community Outreach Intern to support our public health campaigns. You'll be responsible for community outreach, managing communications with partner organizations, and creating reports using MS Office suite.",
    "tags": ["field", "community", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-11-02",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Community Outreach Intern SkyNet Solutions Remote Social Sector Communication MS Office Community Outreach field community remote A remote role for a Community Outreach Intern to support our public health campaigns. You'll be responsible for community outreach, managing communications with partner organizations, and creating reports using MS Office suite."
  },
  {
    "id": "INT-064",
    "title": "Cybersecurity Intern",
    "company": "Inkspire Studios",
    "location": "Patna, Bihar",
    "sector": "Information Technology",
    "skills": ["Docker", "Machine Learning", "Python"],
    "apply_url": "https://pm-internships.example/apply/INT-064",
    "job_description": "Work with our IT security team to protect our digital assets. You'll use Python for security scripting, help secure our containerized applications with Docker, and assist in developing machine learning models for threat detection.",
    "tags": ["tech", "software", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-11-03",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Cybersecurity Intern Inkspire Studios Patna, Bihar Information Technology Docker Machine Learning Python tech software full-time Work with our IT security team to protect our digital assets. You'll use Python for security scripting, help secure our containerized applications with Docker, and assist in developing machine learning models for threat detection."
  },
  {
    "id": "INT-065",
    "title": "Supply Chain Intern",
    "company": "Sahitya Media",
    "location": "Lucknow, Uttar Pradesh",
    "sector": "Agriculture",
    "skills": ["Field Research", "IoT", "Logistics"],
    "apply_url": "https://pm-internships.example/apply/INT-065",
    "job_description": "We are seeking a Supply Chain Intern to help optimize our logistics for agricultural projects. You'll conduct field research to understand local distribution networks, assist with the logistics of our IoT technology, and help improve the efficiency of our supply chain.",
    "tags": ["logistics", "agri", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹10,000-20,000",
    "posted_at": "2025-11-04",
    "metadata": {"company_size":"50-200","industry":"media"},
    "text_blob": "Supply Chain Intern Sahitya Media Lucknow, Uttar Pradesh Agriculture Field Research IoT Logistics logistics agri full-time We are seeking a Supply Chain Intern to help optimize our logistics for agricultural projects. You'll conduct field research to understand local distribution networks, assist with the logistics of our IoT technology, and help improve the efficiency of our supply chain."
  },
  {
    "id": "INT-066",
    "title": "Legal Research Intern",
    "company": "SecuGuard",
    "location": "Ahmedabad, Gujarat",
    "sector": "Legal",
    "skills": ["Legal Research", "Drafting", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-066",
    "job_description": "Join the legal team at SecuGuard to focus on cybersecurity law. You'll conduct legal research on digital security regulations, assist in drafting privacy policies, and provide support on legal matters related to our cybersecurity products.",
    "tags": ["legal", "research", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-11-05",
    "metadata": {"company_size":"50-200","industry":"security"},
    "text_blob": "Legal Research Intern SecuGuard Ahmedabad, Gujarat Legal Legal Research Drafting Cyber Law legal research remote-friendly Join the legal team at SecuGuard to focus on cybersecurity law. You'll conduct legal research on digital security regulations, assist in drafting privacy policies, and provide support on legal matters related to our cybersecurity products."
  },
  {
    "id": "INT-067",
    "title": "Risk Analysis Intern",
    "company": "Inkspire Studios",
    "location": "Kolkata, West Bengal",
    "sector": "Finance",
    "skills": ["Risk Modeling", "Excel", "Financial Analysis"],
    "apply_url": "https://pm-internships.example/apply/INT-067",
    "job_description": "We're hiring a Risk Analysis Intern for our finance department. You will assist with financial analysis of new projects, create risk models for our production budgets, and use Excel to manage financial data.",
    "tags": ["finance", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-18,000",
    "posted_at": "2025-11-06",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Risk Analysis Intern Inkspire Studios Kolkata, West Bengal Finance Risk Modeling Excel Financial Analysis finance data part-time We're hiring a Risk Analysis Intern for our finance department. You will assist with financial analysis of new projects, create risk models for our production budgets, and use Excel to manage financial data."
  },
  {
    "id": "INT-068",
    "title": "Journalism Intern",
    "company": "Swasth Analytics",
    "location": "Mumbai, Maharashtra",
    "sector": "Media",
    "skills": ["Writing", "SEO Basics", "Storytelling"],
    "apply_url": "https://pm-internships.example/apply/INT-068",
    "job_description": "Contribute to our healthcare journalism platform. As a Journalism Intern, you'll be responsible for researching and writing articles on public health topics, using storytelling to make complex information accessible, and applying SEO basics to increase readership.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-11-07",
    "metadata": {"company_size":"50-200","industry":"healthcare"},
    "text_blob": "Journalism Intern Swasth Analytics Mumbai, Maharashtra Media Writing SEO Basics Storytelling content writing remote-friendly Contribute to our healthcare journalism platform. As a Journalism Intern, you'll be responsible for researching and writing articles on public health topics, using storytelling to make complex information accessible, and applying SEO basics to increase readership."
  },
  {
    "id": "INT-069",
    "title": "Geospatial Data Intern",
    "company": "SecuGuard",
    "location": "Hyderabad, Telangana",
    "sector": "Geospatial",
    "skills": ["Satellite Data", "GIS", "Remote Sensing"],
    "apply_url": "https://pm-internships.example/apply/INT-069",
    "job_description": "SecuGuard is seeking a Geospatial Data Intern to analyze satellite data for security applications. You'll use GIS software to map critical infrastructure and apply remote sensing techniques to monitor key locations.",
    "tags": ["geospatial", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-11-08",
    "metadata": {"company_size":"50-200","industry":"security"},
    "text_blob": "Geospatial Data Intern SecuGuard Hyderabad, Telangana Geospatial Satellite Data GIS Remote Sensing geospatial data part-time SecuGuard is seeking a Geospatial Data Intern to analyze satellite data for security applications. You'll use GIS software to map critical infrastructure and apply remote sensing techniques to monitor key locations."
  },
  {
    "id": "INT-070",
    "title": "Creative Writing Intern",
    "company": "EarthVision",
    "location": "Mumbai, Maharashtra",
    "sector": "Media",
    "skills": ["Research", "Storytelling", "Writing"],
    "apply_url": "https://pm-internships.example/apply/INT-070",
    "job_description": "We are looking for a Creative Writing Intern to craft compelling narratives about climate change and sustainability. You will conduct research, write engaging articles, and use storytelling to inspire action.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-11-09",
    "metadata": {"company_size":"50-200","industry":"geospatial"},
    "text_blob": "Creative Writing Intern EarthVision Mumbai, Maharashtra Media Research Storytelling Writing content writing remote-friendly We are looking for a Creative Writing Intern to craft compelling narratives about climate change and sustainability. You will conduct research, write engaging articles, and use storytelling to inspire action."
  },
  {
    "id": "INT-071",
    "title": "Remote Sensing Intern",
    "company": "BioHealth Labs",
    "location": "Pune, Maharashtra",
    "sector": "Geospatial",
    "skills": ["GIS", "Remote Sensing", "Satellite Data"],
    "apply_url": "https://pm-internships.example/apply/INT-071",
    "job_description": "Assist our research team in using geospatial technology to study public health trends. You will work with GIS software, perform remote sensing analysis, and process satellite data to map disease outbreaks and population health metrics.",
    "tags": ["geospatial", "data", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-11-10",
    "metadata": {"company_size":"50-200","industry":"biotech"},
    "text_blob": "Remote Sensing Intern BioHealth Labs Pune, Maharashtra Geospatial GIS Remote Sensing Satellite Data geospatial data remote-friendly Assist our research team in using geospatial technology to study public health trends. You will work with GIS software, perform remote sensing analysis, and process satellite data to map disease outbreaks and population health metrics."
  },
  {
    "id": "INT-072",
    "title": "Pharma Research Intern",
    "company": "LifeCare Hospital",
    "location": "Delhi, India",
    "sector": "Healthcare",
    "skills": ["Communication", "Data Analysis", "Lab Work"],
    "apply_url": "https://pm-internships.example/apply/INT-072",
    "job_description": "Join our clinical research team. You will be responsible for assisting with lab work, analyzing clinical trial data, and communicating research findings to our senior scientists.",
    "tags": ["lab", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-11-11",
    "metadata": {"company_size":"200-500","industry":"healthcare"},
    "text_blob": "Pharma Research Intern LifeCare Hospital Delhi, India Healthcare Communication Data Analysis Lab Work lab research full-time Join our clinical research team. You will be responsible for assisting with lab work, analyzing clinical trial data, and communicating research findings to our senior scientists."
  },
  {
    "id": "INT-073",
    "title": "Cyber Law Intern",
    "company": "NextGen AI Labs",
    "location": "Nagpur, Maharashtra",
    "sector": "Legal",
    "skills": ["Legal Research", "Drafting", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-073",
    "job_description": "We are seeking a Cyber Law Intern to support our legal team. You will conduct legal research on intellectual property and data privacy, assist in drafting contracts, and ensure our edtech platforms comply with all cyber law regulations.",
    "tags": ["legal", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-11-12",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Cyber Law Intern NextGen AI Labs Nagpur, Maharashtra Legal Legal Research Drafting Cyber Law legal tech full-time We are seeking a Cyber Law Intern to support our legal team. You will conduct legal research on intellectual property and data privacy, assist in drafting contracts, and ensure our edtech platforms comply with all cyber law regulations."
  },
  {
    "id": "INT-074",
    "title": "Rural Marketing Intern",
    "company": "Swasth Analytics",
    "location": "Nagpur, Maharashtra",
    "sector": "Marketing",
    "skills": ["Social Media", "Content Creation", "Communication"],
    "apply_url": "https://pm-internships.example/apply/INT-074",
    "job_description": "Help us reach rural communities to promote our healthcare solutions. Your role will involve creating social media content, communicating with rural health workers, and developing targeted marketing materials.",
    "tags": ["marketing", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-11-13",
    "metadata": {"company_size":"50-200","industry":"healthcare"},
    "text_blob": "Rural Marketing Intern Swasth Analytics Nagpur, Maharashtra Marketing Social Media Content Creation Communication marketing rural part-time Help us reach rural communities to promote our healthcare solutions. Your role will involve creating social media content, communicating with rural health workers, and developing targeted marketing materials."
  },
  {
    "id": "INT-075",
    "title": "Legal Research Intern",
    "company": "GeoIndia",
    "location": "Patna, Bihar",
    "sector": "Legal",
    "skills": ["Drafting", "Cyber Law", "Legal Research"],
    "apply_url": "https://pm-internships.example/apply/INT-075",
    "job_description": "We are seeking a Legal Research Intern to support our legal department. You will conduct research on land rights and agricultural policies, assist in drafting legal documents, and ensure compliance with cyber law regulations related to our data.",
    "tags": ["legal", "research", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-11-14",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "Legal Research Intern GeoIndia Patna, Bihar Legal Drafting Cyber Law Legal Research legal research remote-friendly We are seeking a Legal Research Intern to support our legal department. You will conduct research on land rights and agricultural policies, assist in drafting legal documents, and ensure compliance with cyber law regulations related to our data."
  },
  {
    "id": "INT-076",
    "title": "Content Writing Intern",
    "company": "SecuGuard",
    "location": "Ahmedabad, Gujarat",
    "sector": "Media",
    "skills": ["Research", "Writing", "Storytelling"],
    "apply_url": "https://pm-internships.example/apply/INT-076",
    "job_description": "Create engaging content about cybersecurity. As a Content Writing Intern, you will research security threats, write articles and blog posts, and use storytelling to make technical topics accessible to a broad audience.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-11-15",
    "metadata": {"company_size":"50-200","industry":"security"},
    "text_blob": "Content Writing Intern SecuGuard Ahmedabad, Gujarat Media Research Writing Storytelling content writing remote-friendly Create engaging content about cybersecurity. As a Content Writing Intern, you will research security threats, write articles and blog posts, and use storytelling to make technical topics accessible to a broad audience."
  },
  {
    "id": "INT-077",
    "title": "Fullstack Intern",
    "company": "LawBridge Associates",
    "location": "Jaipur, Rajasthan",
    "sector": "Information Technology",
    "skills": ["Cloud", "Java", "Kubernetes"],
    "apply_url": "https://pm-internships.example/apply/INT-077",
    "job_description": "We are seeking a Fullstack Intern to help develop and maintain our legal tech platform. The role involves developing applications in Java, managing cloud infrastructure, and using Kubernetes to deploy our services.",
    "tags": ["tech", "software", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-11-16",
    "metadata": {"company_size":"50-200","industry":"legal"},
    "text_blob": "Fullstack Intern LawBridge Associates Jaipur, Rajasthan Information Technology Cloud Java Kubernetes tech software full-time We are seeking a Fullstack Intern to help develop and maintain our legal tech platform. The role involves developing applications in Java, managing cloud infrastructure, and using Kubernetes to deploy our services."
  },
  {
    "id": "INT-078",
    "title": "Rural Outreach Intern",
    "company": "Swasth Analytics",
    "location": "Delhi, India",
    "sector": "Agriculture",
    "skills": ["IoT", "Field Research", "Crop Analytics"],
    "apply_url": "https://pm-internships.example/apply/INT-078",
    "job_description": "Contribute to our rural health and wellness programs. You will conduct field research on health metrics in farming communities, use IoT devices to collect environmental data, and apply crop analytics to study the link between agriculture and public health.",
    "tags": ["field", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-11-17",
    "metadata": {"company_size":"50-200","industry":"healthcare"},
    "text_blob": "Rural Outreach Intern Swasth Analytics Delhi, India Agriculture IoT Field Research Crop Analytics field rural part-time Contribute to our rural health and wellness programs. You will conduct field research on health metrics in farming communities, use IoT devices to collect environmental data, and apply crop analytics to study the link between agriculture and public health."
  },
  {
    "id": "INT-079",
    "title": "Pharma Research Intern",
    "company": "GeoIndia",
    "location": "Delhi, India",
    "sector": "Healthcare",
    "skills": ["Data Analysis", "Communication", "Lab Work"],
    "apply_url": "https://pm-internships.example/apply/INT-079",
    "job_description": "We are seeking a Pharma Research Intern to support our agro-biotech division. You will assist with lab work on plant-based medicines, analyze data from clinical trials, and communicate your findings to our research team.",
    "tags": ["lab", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-11-18",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "Pharma Research Intern GeoIndia Delhi, India Healthcare Data Analysis Communication Lab Work lab research full-time We are seeking a Pharma Research Intern to support our agro-biotech division. You will assist with lab work on plant-based medicines, analyze data from clinical trials, and communicate your findings to our research team."
  },
  {
    "id": "INT-080",
    "title": "Geospatial Data Intern",
    "company": "NextGen AI Labs",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Geospatial",
    "skills": ["GIS", "Satellite Data", "Remote Sensing"],
    "apply_url": "https://pm-internships.example/apply/INT-080",
    "job_description": "Join our team to help create educational content with geospatial data. You'll process satellite data, use GIS software to create interactive maps, and apply remote sensing techniques to support our online learning modules.",
    "tags": ["geospatial", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-11-19",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "Geospatial Data Intern NextGen AI Labs Bhopal, Madhya Pradesh Geospatial GIS Satellite Data Remote Sensing geospatial data part-time Join our team to help create educational content with geospatial data. You'll process satellite data, use GIS software to create interactive maps, and apply remote sensing techniques to support our online learning modules."
  },
  {
    "id": "INT-081",
    "title": "Education Support Intern",
    "company": "FinSecure Pvt Ltd",
    "location": "Ahmedabad, Gujarat",
    "sector": "Social Sector",
    "skills": ["MS Office", "Communication", "Field Coordination"],
    "apply_url": "https://pm-internships.example/apply/INT-081",
    "job_description": "Help us run our financial literacy programs for underserved communities. This role involves coordinating field workshops, communicating with participants, and managing program data and reports using MS Office.",
    "tags": ["field", "community", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-11-20",
    "metadata": {"company_size":"10-50","industry":"fintech"},
    "text_blob": "Education Support Intern FinSecure Pvt Ltd Ahmedabad, Gujarat Social Sector MS Office Communication Field Coordination field community part-time Help us run our financial literacy programs for underserved communities. This role involves coordinating field workshops, communicating with participants, and managing program data and reports using MS Office."
  },
  {
    "id": "INT-082",
    "title": "Content Writing Intern",
    "company": "GeoIndia",
    "location": "Mumbai, Maharashtra",
    "sector": "Media",
    "skills": ["Storytelling", "SEO Basics", "Writing"],
    "apply_url": "https://pm-internships.example/apply/INT-082",
    "job_description": "We are seeking a Content Writing Intern to create content that highlights our agricultural solutions. You'll use storytelling to connect with our audience, write engaging articles and posts, and apply SEO basics to improve visibility.",
    "tags": ["content", "writing", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹2,000-7,000",
    "posted_at": "2025-11-21",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "Content Writing Intern GeoIndia Mumbai, Maharashtra Media Storytelling SEO Basics Writing content writing remote-friendly We are seeking a Content Writing Intern to create content that highlights our agricultural solutions. You'll use storytelling to connect with our audience, write engaging articles and posts, and apply SEO basics to improve visibility."
  },
  {
    "id": "INT-083",
    "title": "AgriTech Intern",
    "company": "NextGen AI Labs",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Agriculture",
    "skills": ["Logistics", "Field Research", "Crop Analytics"],
    "apply_url": "https://pm-internships.example/apply/INT-083",
    "job_description": "Join our team to innovate in the agritech sector. You'll conduct field research to gather data, assist with the logistics of deploying our technology, and use crop analytics to inform product development.",
    "tags": ["tech", "agri", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹10,000-20,000",
    "posted_at": "2025-11-22",
    "metadata": {"company_size":"10-50","industry":"edtech"},
    "text_blob": "AgriTech Intern NextGen AI Labs Bhopal, Madhya Pradesh Agriculture Logistics Field Research Crop Analytics tech agri full-time Join our team to innovate in the agritech sector. You'll conduct field research to gather data, assist with the logistics of deploying our technology, and use crop analytics to inform product development."
  },
  {
    "id": "INT-084",
    "title": "Cyber Law Intern",
    "company": "AdSphere Media",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Legal",
    "skills": ["Legal Research", "Drafting", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-084",
    "job_description": "We are looking for a Cyber Law Intern to support our legal team. You will conduct legal research on media law and data privacy, assist with drafting legal documents, and ensure compliance with cyber law regulations related to our digital content.",
    "tags": ["legal", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-11-23",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Cyber Law Intern AdSphere Media Bhopal, Madhya Pradesh Legal Legal Research Drafting Cyber Law legal tech full-time We are looking for a Cyber Law Intern to support our legal team. You will conduct legal research on media law and data privacy, assist with drafting legal documents, and ensure compliance with cyber law regulations related to our digital content."
  },
  {
    "id": "INT-085",
    "title": "Risk Analysis Intern",
    "company": "LifeCare Hospital",
    "location": "Pune, Maharashtra",
    "sector": "Finance",
    "skills": ["Risk Modeling", "Financial Analysis", "Excel"],
    "apply_url": "https://pm-internships.example/apply/INT-085",
    "job_description": "Join our finance team to analyze financial risks for new hospital projects. You will assist with risk modeling, conduct financial analysis on healthcare market trends, and use Excel to manage financial data.",
    "tags": ["finance", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-18,000",
    "posted_at": "2025-11-24",
    "metadata": {"company_size":"200-500","industry":"healthcare"},
    "text_blob": "Risk Analysis Intern LifeCare Hospital Pune, Maharashtra Finance Risk Modeling Financial Analysis Excel finance data part-time Join our finance team to analyze financial risks for new hospital projects. You will assist with risk modeling, conduct financial analysis on healthcare market trends, and use Excel to manage financial data."
  },
  {
    "id": "INT-086",
    "title": "Community Outreach Intern",
    "company": "Nayi Disha NGO",
    "location": "Remote",
    "sector": "Social Sector",
    "skills": ["Field Coordination", "Communication", "MS Office"],
    "apply_url": "https://pm-internships.example/apply/INT-086",
    "job_description": "A remote role for a Community Outreach Intern to support our social programs. You will coordinate with our field teams, communicate with community members to gather feedback, and use MS Office to manage program data and reports.",
    "tags": ["field", "community", "remote"],
    "remote": true,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-11-25",
    "metadata": {"company_size":"10-50","industry":"non-profit"},
    "text_blob": "Community Outreach Intern Nayi Disha NGO Remote Social Sector Field Coordination Communication MS Office field community remote A remote role for a Community Outreach Intern to support our social programs. You will coordinate with our field teams, communicate with community members to gather feedback, and use MS Office to manage program data and reports."
  },
  {
    "id": "INT-087",
    "title": "Cloud Engineering Intern",
    "company": "CityCare Hospital",
    "location": "Mumbai, Maharashtra",
    "sector": "Information Technology",
    "skills": ["Cloud", "Kubernetes", "Docker"],
    "apply_url": "https://pm-internships.example/apply/INT-087",
    "job_description": "Join our IT team to assist with cloud infrastructure for our healthcare systems. You'll work with cloud services, orchestrate containers with Kubernetes, and use Docker to manage our applications.",
    "tags": ["tech", "software", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹15,000-25,000",
    "posted_at": "2025-11-26",
    "metadata": {"company_size":"50-200","industry":"healthcare"},
    "text_blob": "Cloud Engineering Intern CityCare Hospital Mumbai, Maharashtra Information Technology Cloud Kubernetes Docker tech software full-time Join our IT team to assist with cloud infrastructure for our healthcare systems. You'll work with cloud services, orchestrate containers with Kubernetes, and use Docker to manage our applications."
  },
  {
    "id": "INT-088",
    "title": "Hospital Administration Intern",
    "company": "Nayi Disha NGO",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Healthcare",
    "skills": ["Communication", "Biostatistics", "Lab Work"],
    "apply_url": "https://pm-internships.example/apply/INT-088",
    "job_description": "We are seeking a Hospital Administration Intern to assist in the daily operations of our community health clinic. This involves supporting patient communication, helping with lab work, and using biostatistics to track health outcomes for our programs.",
    "tags": ["healthcare", "admin", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-11-27",
    "metadata": {"company_size":"10-50","industry":"non-profit"},
    "text_blob": "Hospital Administration Intern Nayi Disha NGO Bhopal, Madhya Pradesh Healthcare Communication Biostatistics Lab Work healthcare admin full-time We are seeking a Hospital Administration Intern to assist in the daily operations of our community health clinic. This involves supporting patient communication, helping with lab work, and using biostatistics to track health outcomes for our programs."
  },
  {
    "id": "INT-089",
    "title": "Pharma Research Intern",
    "company": "FarmTech India",
    "location": "Kolkata, West Bengal",
    "sector": "Healthcare",
    "skills": ["MS Office", "Lab Work", "Data Analysis"],
    "apply_url": "https://pm-internships.example/apply/INT-089",
    "job_description": "Contribute to our research on plant-based medicines. You will assist with lab work, perform data analysis on research findings, and use MS Office tools to organize and present your data.",
    "tags": ["lab", "research", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-15,000",
    "posted_at": "2025-11-28",
    "metadata": {"company_size":"10-50","industry":"agritech"},
    "text_blob": "Pharma Research Intern FarmTech India Kolkata, West Bengal Healthcare MS Office Lab Work Data Analysis lab research full-time Contribute to our research on plant-based medicines. You will assist with lab work, perform data analysis on research findings, and use MS Office tools to organize and present your data."
  },
  {
    "id": "INT-090",
    "title": "Rural Marketing Intern",
    "company": "AgriSupply Co.",
    "location": "Pune, Maharashtra",
    "sector": "Marketing",
    "skills": ["Google Analytics", "Content Creation", "Social Media"],
    "apply_url": "https://pm-internships.example/apply/INT-090",
    "job_description": "Help us grow our brand presence in rural markets. You'll create compelling content for social media, use Google Analytics to measure campaign success, and work on strategies to connect with our rural customer base.",
    "tags": ["marketing", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-11-29",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Rural Marketing Intern AgriSupply Co. Pune, Maharashtra Marketing Google Analytics Content Creation Social Media marketing rural part-time Help us grow our brand presence in rural markets. You'll create compelling content for social media, use Google Analytics to measure campaign success, and work on strategies to connect with our rural customer base."
  },
  {
    "id": "INT-091",
    "title": "Accounting Intern",
    "company": "GeoIndia",
    "location": "Patna, Bihar",
    "sector": "Finance",
    "skills": ["Excel", "Risk Modeling", "Financial Analysis"],
    "apply_url": "https://pm-internships.example/apply/INT-091",
    "job_description": "We are seeking an Accounting Intern to support our finance department. You'll assist with financial analysis of our agricultural projects, create risk models for new ventures, and use Excel to manage and analyze financial data.",
    "tags": ["finance", "data", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-18,000",
    "posted_at": "2025-11-30",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "Accounting Intern GeoIndia Patna, Bihar Finance Excel Risk Modeling Financial Analysis finance data part-time We are seeking an Accounting Intern to support our finance department. You'll assist with financial analysis of our agricultural projects, create risk models for new ventures, and use Excel to manage and analyze financial data."
  },
  {
    "id": "INT-092",
    "title": "Community Outreach Intern",
    "company": "Inkspire Studios",
    "location": "Patna, Bihar",
    "sector": "Social Sector",
    "skills": ["Communication", "Field Coordination", "MS Office"],
    "apply_url": "https://pm-internships.example/apply/INT-092",
    "job_description": "Join our CSR team to support community events related to the creative arts. You will assist with community outreach, coordinate field activities, and use MS Office to manage data and create reports.",
    "tags": ["field", "community", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-12-01",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Community Outreach Intern Inkspire Studios Patna, Bihar Social Sector Communication Field Coordination MS Office field community part-time Join our CSR team to support community events related to the creative arts. You will assist with community outreach, coordinate field activities, and use MS Office to manage data and create reports."
  },
  {
    "id": "INT-093",
    "title": "Legal Research Intern",
    "company": "Inkspire Studios",
    "location": "Patna, Bihar",
    "sector": "Legal",
    "skills": ["Drafting", "Legal Research", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-093",
    "job_description": "We're looking for a Legal Research Intern to support our legal team. Your work will involve researching legal precedents related to media content and intellectual property, assisting with drafting contracts, and ensuring compliance with cyber law regulations.",
    "tags": ["legal", "research", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-12-02",
    "metadata": {"company_size":"200-500","industry":"media"},
    "text_blob": "Legal Research Intern Inkspire Studios Patna, Bihar Legal Drafting Legal Research Cyber Law legal research remote-friendly We're looking for a Legal Research Intern to support our legal team. Your work will involve researching legal precedents related to media content and intellectual property, assisting with drafting contracts, and ensuring compliance with cyber law regulations."
  },
  {
    "id": "INT-094",
    "title": "Remote Sensing Intern",
    "company": "AdSphere Media",
    "location": "Nagpur, Maharashtra",
    "sector": "Geospatial",
    "skills": ["Remote Sensing", "GIS", "Satellite Data"],
    "apply_url": "https://pm-internships.example/apply/INT-094",
    "job_description": "Assist our media team in creating visual stories with geospatial data. You'll perform remote sensing analysis, use GIS software to create maps, and process satellite data to support our documentary and news projects.",
    "tags": ["geospatial", "data", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹8,000-15,000",
    "posted_at": "2025-12-03",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Remote Sensing Intern AdSphere Media Nagpur, Maharashtra Geospatial Remote Sensing GIS Satellite Data geospatial data remote-friendly Assist our media team in creating visual stories with geospatial data. You'll perform remote sensing analysis, use GIS software to create maps, and process satellite data to support our documentary and news projects."
  },
  {
    "id": "INT-095",
    "title": "Cyber Law Intern",
    "company": "AdSphere Media",
    "location": "Bhopal, Madhya Pradesh",
    "sector": "Legal",
    "skills": ["Legal Research", "Drafting", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-095",
    "job_description": "Support our legal team by researching data privacy regulations and cybersecurity. You'll assist in drafting legal policies and ensure our digital media operations comply with all relevant cyber law.",
    "tags": ["legal", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-12-04",
    "metadata": {"company_size":"10-50","industry":"media"},
    "text_blob": "Cyber Law Intern AdSphere Media Bhopal, Madhya Pradesh Legal Legal Research Drafting Cyber Law legal tech full-time Support our legal team by researching data privacy regulations and cybersecurity. You'll assist in drafting legal policies and ensure our digital media operations comply with all relevant cyber law."
  },
  {
    "id": "INT-096",
    "title": "Digital Marketing Intern",
    "company": "Swasth Analytics",
    "location": "Jaipur, Rajasthan",
    "sector": "Marketing",
    "skills": ["Content Creation", "Google Analytics", "Social Media"],
    "apply_url": "https://pm-internships.example/apply/INT-096",
    "job_description": "We are seeking a Digital Marketing Intern to help us promote our healthcare analytics solutions. You will create engaging content for social media, use Google Analytics to track campaign performance, and help us improve our online presence.",
    "tags": ["marketing", "digital", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-12-05",
    "metadata": {"company_size":"50-200","industry":"healthcare"},
    "text_blob": "Digital Marketing Intern Swasth Analytics Jaipur, Rajasthan Marketing Content Creation Google Analytics Social Media marketing digital remote-friendly We are seeking a Digital Marketing Intern to help us promote our healthcare analytics solutions. You will create engaging content for social media, use Google Analytics to track campaign performance, and help us improve our online presence."
  },
  {
    "id": "INT-097",
    "title": "Legal Research Intern",
    "company": "AgriSupply Co.",
    "location": "Ahmedabad, Gujarat",
    "sector": "Legal",
    "skills": ["Drafting", "Legal Research", "Cyber Law"],
    "apply_url": "https://pm-internships.example/apply/INT-097",
    "job_description": "Join our legal department to focus on agricultural regulations and cyber law. You'll assist with legal research, help in drafting contracts, and ensure our business practices comply with relevant legal frameworks.",
    "tags": ["legal", "research", "remote-friendly"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-12-06",
    "metadata": {"company_size":"200-500","industry":"agrisupply"},
    "text_blob": "Legal Research Intern AgriSupply Co. Ahmedabad, Gujarat Legal Drafting Legal Research Cyber Law legal research remote-friendly Join our legal department to focus on agricultural regulations and cyber law. You'll assist with legal research, help in drafting contracts, and ensure our business practices comply with relevant legal frameworks."
  },
  {
    "id": "INT-098",
    "title": "Policy Research Intern",
    "company": "Nayi Disha NGO",
    "location": "Mumbai, Maharashtra",
    "sector": "Social Sector",
    "skills": ["Field Coordination", "MS Office", "Community Outreach"],
    "apply_url": "https://pm-internships.example/apply/INT-098",
    "job_description": "Nayi Disha NGO is hiring a Policy Research Intern to investigate and report on social policies. You will assist with community outreach, coordinate field activities, and use MS Office to manage research data and create reports for our stakeholders.",
    "tags": ["research", "community", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-10,000",
    "posted_at": "2025-12-07",
    "metadata": {"company_size":"10-50","industry":"non-profit"},
    "text_blob": "Policy Research Intern Nayi Disha NGO Mumbai, Maharashtra Social Sector Field Coordination MS Office Community Outreach research community full-time Nayi Disha NGO is hiring a Policy Research Intern to investigate and report on social policies. You will assist with community outreach, coordinate field activities, and use MS Office to manage research data and create reports for our stakeholders."
  },
  {
    "id": "INT-099",
    "title": "Rural Marketing Intern",
    "company": "FinSecure Pvt Ltd",
    "location": "Nagpur, Maharashtra",
    "sector": "Marketing",
    "skills": ["Social Media", "Content Creation", "Communication"],
    "apply_url": "https://pm-internships.example/apply/INT-099",
    "job_description": "Help us with marketing our financial literacy products to rural communities. You'll create compelling content for social media, communicate with local partners, and help with our rural outreach campaigns.",
    "tags": ["marketing", "rural", "part-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹5,000-10,000",
    "posted_at": "2025-12-08",
    "metadata": {"company_size":"10-50","industry":"fintech"},
    "text_blob": "Rural Marketing Intern FinSecure Pvt Ltd Nagpur, Maharashtra Marketing Social Media Content Creation Communication marketing rural part-time Help us with marketing our financial literacy products to rural communities. You'll create compelling content for social media, communicate with local partners, and help with our rural outreach campaigns."
  },
  {
    "id": "INT-100",
    "title": "Cyber Law Intern",
    "company": "GeoIndia",
    "location": "Hyderabad, Telangana",
    "sector": "Legal",
    "skills": ["Cyber Law", "Drafting", "Legal Research"],
    "apply_url": "https://pm-internships.example/apply/INT-100",
    "job_description": "We are seeking a Cyber Law Intern to support our legal team. You'll focus on legal matters related to agricultural technology, conduct legal research on data privacy and security, and assist in drafting legal documents.",
    "tags": ["legal", "tech", "full-time"],
    "remote": false,
    "duration_weeks": 12,
    "salary_range": "₹0-5,000",
    "posted_at": "2025-12-09",
    "metadata": {"company_size":"100-500","industry":"agritech"},
    "text_blob": "Cyber Law Intern GeoIndia Hyderabad, Telangana Legal Cyber Law Drafting Legal Research legal tech full-time We are seeking a Cyber Law Intern to support our legal team. You'll focus on legal matters related to agricultural technology, conduct legal research on data privacy and security, and assist in drafting legal documents."
  }
]